[
    {
        "url": "https://www.linkedin.com/in/yasser-yjjou",
        "profile": {
            "name": "Yasser Yjjou",
            "location": "Rabat, Rabat-Salé-Kénitra, Maroc",
            "about": "Compétences principales\nCompétences principales\nKotlin • Object-Oriented Programming (OOP)\nKotlin • Object-Oriented Programming (OOP)",
            "open_to_work": "N/A"
        },
        "experiences": [
            {
                "title": "Mobile Application Developer",
                "company": "Benbar Ingénierie et Conseil · Contrat en alternance",
                "from": "juil. 2025",
                "to": "aujourd’hui",
                "description": "Compétences : Flutter · Kotlin · Swift (Programming Language)\nCompétences :Flutter · Kotlin · Swift (Programming Language)"
            },
            {
                "title": "Mobile Application Developer",
                "company": "Cités des Métiers et des Compétences · Contrat en alternance",
                "from": "juin 2023",
                "to": "juil. 2025",
                "description": "Compétences : Mobile Application Development · Kotlin · Flutter · Soft Skills · Administration\nCompétences :Mobile Application Development · Kotlin · Flutter · Soft Skills · Administration\nCmC.jpg\nCmC.jpg\nDEVOAM202.jpg\nDEVOAM202.jpg\nSoutnance.jpg\nSoutnance.jpg"
            },
            {
                "title": "Mobile Application Developer",
                "company": "Ministère de la Justice - وزارة العدل · Stage",
                "from": "mars 2025",
                "to": "mai 2025",
                "description": "Compétences : Mobile Application Development · Team Leadership · Time Management · Flutter\nCompétences :Mobile Application Development · Team Leadership · Time Management · Flutter"
            }
        ],
        "educations": [
            {
                "institution": "Cités des Métiers et des compétences Rabat",
                "degree": "TS en développement digital Option mobile",
                "from": "juin",
                "to": "2023",
                "description": "Compétences : Flask · Android Development · Kotlin · Android · Ktor · Android SDK · Flutter · Development · Software Development\nCompétences :Flask · Android Development · Kotlin · Android · Ktor · Android SDK · Flutter · Development · Software Development"
            },
            {
                "institution": "Cités des Métiers et des compétences Rabat",
                "degree": "TS en développement digital Option mobile",
                "from": "juin",
                "to": "2023",
                "description": "Compétences : Flask · Android Development · Kotlin · Android · Ktor · Android SDK · Flutter · Development · Software Development\nCompétences :Flask · Android Development · Kotlin · Android · Ktor · Android SDK · Flutter · Development · Software Development"
            },
            {
                "institution": "Cités des Métiers et des compétences Rabat",
                "degree": "TS en développement digital Option mobile",
                "from": "juin",
                "to": "2023",
                "description": "Compétences : Flask · Android Development · Kotlin · Android · Ktor · Android SDK · Flutter · Development · Software Development\nCompétences :Flask · Android Development · Kotlin · Android · Ktor · Android SDK · Flutter · Development · Software Development"
            }
        ],
        "interests": [],
        "accomplishments": [],
        "contacts": []
    },
    {
        "url": "https://www.linkedin.com/in/billgates",
        "profile": {
            "name": "N/A",
            "location": "N/A",
            "about": "N/A",
            "open_to_work": "N/A"
        },
        "experiences": [],
        "educations": [],
        "interests": [],
        "accomplishments": [],
        "contacts": []
    },
    {
        "url": "https://www.linkedin.com/in/reidhoffman",
        "profile": {
            "name": "Reid Hoffman",
            "location": "États-Unis",
            "about": "My current priority is investing in and building with AI to benefit humanity.\n\nI am active in all facets of the consumer internet and software industries. My focus spans product development, innovation, business strategy, and finance. My expertise also extends to general management, operations, business development, talent management, and marketing. I have experience with seed-stage to massive scale companies such as PayPal, LinkedIn, Airbnb, OpenAI, Facebook, Mozilla, and Zynga, as well as world-scale companies like Microsoft.\n\nMy specialties include general management, product development, strategy, negotiation, financing, deal structuring, international business, marketing, brand development and management, business development, public relations, press strategy, payments infrastructure, financial services, mergers and acquisitions, startups, software development, operations centers, board management, and investing.",
            "open_to_work": "N/A"
        },
        "experiences": [
            {
                "title": "Co-Founder, Board Chair",
                "company": "Manas AI · Temps partiel",
                "from": "janv. 2025",
                "to": "aujourd’hui",
                "description": "Manas AI leverages proprietary AI, generative computational chemistry, and best in class biology to cut the timeline and costs of traditional therapeutic discovery and transform the treatment of cancer and rare disease.\n\nWhile we're still in the early stages of contemporary AI development, initiatives like Manas AI show how close we already are to advances that can profoundly change the world. Success in our quest will give thousands of oncologists around the world new therapeutics to combat diseases that have shaped human existence since before recorded history, constraining human possibilities and causing immense suffering and loss. The future of medicine has never held more promise.\nManas AI leverages proprietary AI, generative computational chemistry, and best in class biology to cut the timeline and costs of traditional therapeutic discovery and transform the treatment of cancer and rare disease. While we're still in the early stages of contemporary AI development, initiatives like Manas AI show how close we already are to advances that can profoundly change the world. Success in our quest will give thousands of oncologists around the world new therapeutics to combat diseases that have shaped human existence since before recorded history, constraining human possibilities and causing immense suffering and loss. The future of medicine has never held more promise."
            },
            {
                "title": "Co-Founder, Board Member",
                "company": "Inflection AI · Temps partiel",
                "from": "mars 2022",
                "to": "aujourd’hui",
                "description": "Inflection AI is a public benefit corporation leveraging our world-class large language model to build the first AI platform focused on the needs of the enterprise. \n\nI helped start Inflection AI to further a vision where artificial intelligence empowers individuals and amplifies human capabilities. In March 2024, an expanded team of kind, innovative, and collaborative individuals grew Inflection’s scope to focus on building enterprise AI solutions.\nInflection AI is a public benefit corporation leveraging our world-class large language model to build the first AI platform focused on the needs of the enterprise. I helped start Inflection AI to further a vision where artificial intelligence empowers individuals and amplifies human capabilities. In March 2024, an expanded team of kind, innovative, and collaborative individuals grew Inflection’s scope to focus on building enterprise AI solutions."
            },
            {
                "title": "Partner",
                "company": "Greylock · Temps plein",
                "from": "nov. 2009",
                "to": "aujourd’hui",
                "description": "Greylock partners with entrepreneurs to build market-transforming companies. Notable Greylock portfolio companies include Linkedin, Airbnb, Facebook, Workday, Roblox, Palo Alto Networks, Dropbox, Pure Storage, Instagram and Discord. I represent Greylock on the boards of Aurora, Entrepreneur First, ManasAI, Tome, and Nauto.\n\nMy primary focus is world-class entrepreneurs with bold new ideas with the possibility of massive scale. I also focus on companies in domains where my product and entrepreneurial experience applies strongly: consumer internet, enterprise 2.0, mobile, social gaming, online marketplaces, payments, SAAS, and social networks.\nGreylock partners with entrepreneurs to build market-transforming companies. Notable Greylock portfolio companies include Linkedin, Airbnb, Facebook, Workday, Roblox, Palo Alto Networks, Dropbox, Pure Storage, Instagram and Discord. I represent Greylock on the boards of Aurora, Entrepreneur First, ManasAI, Tome, and Nauto. My primary focus is world-class entrepreneurs with bold new ideas with the possibility of massive scale. I also focus on companies in domains where my product and entrepreneurial experience applies strongly: consumer internet, enterprise 2.0, mobile, social gaming, online marketplaces, payments, SAAS, and social networks."
            },
            {
                "title": "Chairperson",
                "company": "Village Global · Temps partiel",
                "from": "août 2017",
                "to": "aujourd’hui",
                "description": "Village Global is a network-native VC firm backed by tech industry luminaries. When you join a Village, seed capital is just the beginning. Village helps you go faster with an incredible founder community, expert advice, and game-changing introductions.\n\nAs the Chairman of Village since 2017, I have supported the community as we’ve built a network of experienced founders and advisors who are democratizing access to startup wisdom.\nVillage Global is a network-native VC firm backed by tech industry luminaries. When you join a Village, seed capital is just the beginning. Village helps you go faster with an incredible founder community, expert advice, and game-changing introductions. As the Chairman of Village since 2017, I have supported the community as we’ve built a network of experienced founders and advisors who are democratizing access to startup wisdom."
            },
            {
                "title": "Board Member",
                "company": "Microsoft · Temps partiel",
                "from": "mars 2017",
                "to": "aujourd’hui",
                "description": "Microsoft's mission is to empower every person and every organization on the planet to achieve more.\n\nI believe in technology's power to empower people and transform industries. Microsoft exemplifies this mission at a global scale. Joining the board allowed me to contribute to a company that is using AI and cloud computing to amplify human potential and enhance productivity and creativity for billions.\nMicrosoft's mission is to empower every person and every organization on the planet to achieve more. I believe in technology's power to empower people and transform industries. Microsoft exemplifies this mission at a global scale. Joining the board allowed me to contribute to a company that is using AI and cloud computing to amplify human potential and enhance productivity and creativity for billions."
            },
            {
                "title": "Board Member",
                "company": "Aurora · Temps partiel",
                "from": "janv. 2018",
                "to": "aujourd’hui",
                "description": "Aurora is a leading autonomous vehicle technology company, focused on self-driving solutions for freight, delivery, and passenger transport. The Aurora Driver platform integrates hardware, software, and data services to enable safe and efficient transportation.\nAurora is a bet on the transformative potential of autonomous technology to revolutionize logistics and mobility while addressing pressing challenges like safety and efficiency in transportation.\nAurora is a leading autonomous vehicle technology company, focused on self-driving solutions for freight, delivery, and passenger transport. The Aurora Driver platform integrates hardware, software, and data services to enable safe and efficient transportation. Aurora is a bet on the transformative potential of autonomous technology to revolutionize logistics and mobility while addressing pressing challenges like safety and efficiency in transportation."
            },
            {
                "title": "Board Member",
                "company": "NAUTO · Temps partiel",
                "from": "août 2017",
                "to": "aujourd’hui",
                "description": "Nauto develops AI-powered driver and fleet safety systems to reduce collisions and improve driving behavior. By leveraging real-time insights, it enhances operational efficiency for businesses and supports safer roads for all.\n\nBacking Nauto is an opportunity to leverage AI to make the roads safer while driving value for thousands of businesses.\nNauto develops AI-powered driver and fleet safety systems to reduce collisions and improve driving behavior. By leveraging real-time insights, it enhances operational efficiency for businesses and supports safer roads for all. Backing Nauto is an opportunity to leverage AI to make the roads safer while driving value for thousands of businesses."
            },
            {
                "title": "Board Member",
                "company": "Entrepreneur First",
                "from": "sept. 2017",
                "to": "aujourd’hui",
                "description": "Entrepreneur First identifies founders with extraordinary futures before anyone else, embedding them in a community of ambitious peers and giving them the tools they need to succeed, fast. We back them before they have a company, a team, even before they have an idea, based purely on talent.\n\nServing on Entrepreneur First’s board has allowed me to play a small role in fostering entrepreneurship by investing in individuals and giving more exceptional leaders access to capital.\nEntrepreneur First identifies founders with extraordinary futures before anyone else, embedding them in a community of ambitious peers and giving them the tools they need to succeed, fast. We back them before they have a company, a team, even before they have an idea, based purely on talent. Serving on Entrepreneur First’s board has allowed me to play a small role in fostering entrepreneurship by investing in individuals and giving more exceptional leaders access to capital."
            },
            {
                "title": "Honorary Fellow",
                "company": "Wolfson College, Oxford",
                "from": "oct. 2016",
                "to": "aujourd’hui",
                "description": "I first attended Wolfson College at the University of Oxford as a Marshall Scholar, earning an MSt in Philosophy in 1993. It was a privilege to be awarded an Honorary Fellowship by my alma mater in 2016.\nI first attended Wolfson College at the University of Oxford as a Marshall Scholar, earning an MSt in Philosophy in 1993. It was a privilege to be awarded an Honorary Fellowship by my alma mater in 2016."
            },
            {
                "title": "Dean's Senior Fellow",
                "company": "Cambridge Judge Business School · Temps partiel",
                "from": "juin 2025",
                "to": "aujourd’hui",
                "description": "N/A"
            },
            {
                "title": "Visiting Senior Fellow",
                "company": "The London School of Economics and Political Science (LSE) · Temps partiel",
                "from": "févr. 2025",
                "to": "aujourd’hui",
                "description": "Appointed as a Visiting Senior Fellow at LSE’s Data Science Institute (DSI).\n\nI will interact with LSE students and faculty and participate in events including discussions and workshops during my visits to London. In the role, I will draw on my experience in technological entrepreneurship and the impacts of new technologies on society, the function of education and the university, and geopolitics of technology.\nAppointed as a Visiting Senior Fellow at LSE’s Data Science Institute (DSI). I will interact with LSE students and faculty and participate in events including discussions and workshops during my visits to London. In the role, I will draw on my experience in technological entrepreneurship and the impacts of new technologies on society, the function of education and the university, and geopolitics of technology."
            },
            {
                "title": "Distinguished Fellow",
                "company": "Columbia University · Temps partiel",
                "from": "oct. 2024",
                "to": "aujourd’hui",
                "description": "Institute of Global Politics\nInstitute of Global Politics"
            },
            {
                "title": "Advisory Member",
                "company": "Reinvent Capital · Temps partiel",
                "from": "août 2018",
                "to": "aujourd’hui",
                "description": "Reinvent partners with bold leaders of category-defining companies to help them grow and innovate at scale.\nReinvent partners with bold leaders of category-defining companies to help them grow and innovate at scale."
            },
            {
                "title": "Board Member",
                "company": "Coda · Temps partiel",
                "from": "oct. 2014",
                "to": "déc. 2024",
                "description": "Coda is a collaboration platform that combines the power of spreadsheets and databases into a flexible, dynamic workspace. Their technology makes it so everyone can work together, in their own way, off a single source of truth.\n\nI was honored to serve on Coda’s board from 2014 until December 2024, when Coda was acquired by Grammarly.\nCoda is a collaboration platform that combines the power of spreadsheets and databases into a flexible, dynamic workspace. Their technology makes it so everyone can work together, in their own way, off a single source of truth. I was honored to serve on Coda’s board from 2014 until December 2024, when Coda was acquired by Grammarly."
            },
            {
                "title": "Board Member",
                "company": "Blockstream",
                "from": "nov. 2014",
                "to": "sept. 2024",
                "description": "Blockstream is a leader in Bitcoin and blockchain technology, offering solutions for scaling, security, and decentralized financial systems. Its products include the Liquid Network and Bitcoin mining services.\n\n\nSince 2015, I have been writing about the power of Blockchain technology to redefine finance and ownership online. Serving on Blockstream’s board allowed me to support that vision and a dedicated team of builders.\nBlockstream is a leader in Bitcoin and blockchain technology, offering solutions for scaling, security, and decentralized financial systems. Its products include the Liquid Network and Bitcoin mining services. Since 2015, I have been writing about the power of Blockchain technology to redefine finance and ownership online. Serving on Blockstream’s board allowed me to support that vision and a dedicated team of builders."
            },
            {
                "title": "Board Member",
                "company": "Joby Aviation · Temps partiel",
                "from": "août 2021",
                "to": "juin 2024",
                "description": "Joby Aviation is an electric vertical takeoff and landing (eVTOL) aircraft company aiming to redefine urban transportation. Its aircraft promise zero-emission, quiet, and efficient air travel.\n\nJoby is a pioneer in the future of sustainable, urban transportation.\nJoby Aviation is an electric vertical takeoff and landing (eVTOL) aircraft company aiming to redefine urban transportation. Its aircraft promise zero-emission, quiet, and efficient air travel. Joby is a pioneer in the future of sustainable, urban transportation."
            },
            {
                "title": "Board Member",
                "company": "Convoy Inc",
                "from": "janv. 2016",
                "to": "oct. 2023",
                "description": "Convoy is a digital freight network that uses technology to optimize trucking logistics, reducing costs and environmental impact. It connects shippers with carriers through a seamless platform.\n\nI served on Convoy’s board until 2023, when the company transitioned to become a part of Flexport.\nConvoy is a digital freight network that uses technology to optimize trucking logistics, reducing costs and environmental impact. It connects shippers with carriers through a seamless platform. I served on Convoy’s board until 2023, when the company transitioned to become a part of Flexport."
            },
            {
                "title": "Board Member",
                "company": "Neeva · Temps partiel",
                "from": "janv. 2019",
                "to": "mai 2023",
                "description": "Neeva is search re-imagined. Always ad-free, private, and personal. Co-founded by Sridhar Ramaswamy (ex-SVP of Ads at Google) and Vivek Raghunathan (ex-VP of Monetization at YouTube).\n\nI served on Neeva’s board until their acquisition by Snowflake in 2023\nNeeva is search re-imagined. Always ad-free, private, and personal. Co-founded by Sridhar Ramaswamy (ex-SVP of Ads at Google) and Vivek Raghunathan (ex-VP of Monetization at YouTube). I served on Neeva’s board until their acquisition by Snowflake in 2023"
            },
            {
                "title": "Board Member",
                "company": "OpenAI · Temps partiel",
                "from": "mars 2019",
                "to": "févr. 2023",
                "description": "OpenAI is creating Beneficial Artificial Intelligence for society, humanity, and industries. OpenAI's mission is to ensure that artificial general intelligence (AGI) benefits all of humanity. \nIn 2015, I was honored to be the earliest investor in OpenAI, and serving on the company’s board during the launch of Chat GPT – which kickstarted the broad AI revolution. In 2023 I stepped down from the company’s board to avoid conflicts of interest, though I still remain dedicated to OpenAI’s growth, and the larger mission to use AI to benefit humanity.\nOpenAI is creating Beneficial Artificial Intelligence for society, humanity, and industries. OpenAI's mission is to ensure that artificial general intelligence (AGI) benefits all of humanity. In 2015, I was honored to be the earliest investor in OpenAI, and serving on the company’s board during the launch of Chat GPT – which kickstarted the broad AI revolution. In 2023 I stepped down from the company’s board to avoid conflicts of interest, though I still remain dedicated to OpenAI’s growth, and the larger mission to use AI to benefit humanity."
            },
            {
                "title": "Board Observer",
                "company": "Xapo Bank",
                "from": "juil. 2014",
                "to": "oct. 2021",
                "description": "Xapo combines the convenience of an everyday bitcoin wallet with the security of a deep cold storage vault. By bringing together convenience that bitcoin users want everyday with the security they require for saving, Xapo is the most secure, reliable, and easy way to manage and store your bitcoin.\nXapo combines the convenience of an everyday bitcoin wallet with the security of a deep cold storage vault. By bringing together convenience that bitcoin users want everyday with the security they require for saving, Xapo is the most secure, reliable, and easy way to manage and store your bitcoin."
            }
        ],
        "educations": [
            {
                "institution": "Università degli Studi di Perugia",
                "degree": "Honorary Doctorate, Human Sciences",
                "from": "2024",
                "to": "2024",
                "description": "N/A"
            },
            {
                "institution": "Università degli Studi di Perugia",
                "degree": "Honorary Doctorate, Human Sciences",
                "from": "2024",
                "to": "2024",
                "description": "N/A"
            },
            {
                "institution": "Università degli Studi di Perugia",
                "degree": "Honorary Doctorate, Human Sciences",
                "from": "2024",
                "to": "2024",
                "description": "N/A"
            },
            {
                "institution": "Università degli Studi di Perugia",
                "degree": "Honorary Doctorate, Human Sciences",
                "from": "2024",
                "to": "2024",
                "description": "N/A"
            },
            {
                "institution": "Università degli Studi di Perugia",
                "degree": "Honorary Doctorate, Human Sciences",
                "from": "2024",
                "to": "2024",
                "description": "N/A"
            },
            {
                "institution": "Università degli Studi di Perugia",
                "degree": "Honorary Doctorate, Human Sciences",
                "from": "2024",
                "to": "2024",
                "description": "N/A"
            }
        ],
        "interests": [],
        "accomplishments": [],
        "contacts": []
    }
]