[
    {
        "url": "https://www.linkedin.com/in/rida-lagnaoui-834570238",
        "profile": {
            "name": "Rida Lagnaoui",
            "location": "Maroc",
            "about": "Actuellement Ingénieur Mobile Dev chez The White Camel Camps, je conçois des applications mobiles innovantes et performantes en utilisant Flutter et des architectures modernes comme MVC. J'intègre des solutions avancées telles que Firebase pour la gestion des utilisateurs et des réservations, ainsi que des API sécurisées comme Payzone pour les paiements. \n\nDiplômé en cours de l'Ecole Marocaine des Sciences de l'ingénieur en Ingénierie Informatique et Réseaux MIAGE, je suis également consultant SEO et développeur web freelance. Mon travail se concentre sur l'optimisation des performances des sites, le référencement technique et la création d'expériences utilisateur fluides. Je suis motivé par la collaboration sur des projets ambitieux et orientés utilisateur.\n…voir plus",
            "open_to_work": "N/A"
        },
        "experiences": [
            {
                "title": "Ingénieur Mobile Dev",
                "company": "The White Camel Camps · Temps plein",
                "from": "sept. 2024",
                "to": "aujourd’hui",
                "description": "Interaction régulière avec les clients pour analyse des besoins et validation des fonctionnalités.\nDéveloppement d’une application mobile de gestion de réservations en Flutter (architecture MVC).\nIntégration Firebase (authentification + Firestore) & paiement sécurisé via Payzone API.\nUI responsive, notifications push, et audits techniques de sites web.\nOptimisation SEO avec Yoast SEO, Ahrefs, PageSpeed Insights.\nInteraction régulière avec les clients pour analyse des besoins et validation des fonctionnalités. Développement d’une application mobile de gestion de réservations en Flutter (architecture MVC). Intégration Firebase (authentification + Firestore) & paiement sécurisé via Payzone API. UI responsive, notifications push, et audits techniques de sites web. Optimisation SEO avec Yoast SEO, Ahrefs, PageSpeed Insights.\nCompétences : Référencement on-page · Marketing digital · Référencement · Recherche par mot-clé · Applications mobiles · Flutter · Applications web · WordPress\nRéférencement on-page · Marketing digital · Référencement · Recherche par mot-clé · Applications mobiles · Flutter · Applications web · WordPress"
            },
            {
                "title": "📌 Consultant SEO & Développeur Web Freelance | Optimisation, Création & Testing de Sites Web",
                "company": "Fiverr · Freelance",
                "from": "janv. 2022",
                "to": "aujourd’hui",
                "description": "💼 Services proposés :\n🔹 Audit SEO & Stratégie : Analyse de mots-clés, optimisation on-page et technique.\n🔹 Optimisation SEO On-Page : Structuration des balises HN, optimisation des images, maillage interne, rédaction optimisée.\n🔹 SEO Technique & Expérience Utilisateur : Amélioration de la vitesse, responsive design, sécurité et navigation fluide.\n🔹 SEO Off-Page & Netlinking : Acquisition de backlinks de qualité, suivi des stratégies de netlinking.\n🔹 Suivi & Analyse des KPI SEO : Suivi du trafic, positions Google, performances des backlinks.\n🔹 Création de sites web : Développement de sites vitrines & e-commerce (WordPress, WooCommerce, CMS divers).\n🔹 Testing & Optimisation de sites web : Tests de performance, UX/UI, compatibilité mobile et sécurité.\n\n📊 Outils maîtrisés :\n🔸 Seanking, Ahrefs, Mongools, Dokey.io, Google Search Console, GTmetrix, Monitorank, Semjuice, Yoast SEO, Screaming Frog, WordPress, WooCommerce.\n\n✅ Objectif : Améliorer la visibilité des sites (coachs, e-commerce, génération de leads, blogs), optimiser leur référencement et garantir une expérience utilisateur optimale.\n\n📩 Contactez-moi pour optimiser ou créer votre site web et améliorer votre classement sur Google !🚀\n💼 Services proposés : 🔹 Audit SEO & Stratégie : Analyse de mots-clés, optimisation on-page et technique. 🔹 Optimisation SEO On-Page : Structuration des balises HN, optimisation des images, maillage interne, rédaction optimisée. 🔹 SEO Technique & Expérience Utilisateur : Amélioration de la vitesse, responsive design, sécurité et navigation fluide. 🔹 SEO Off-Page & Netlinking : Acquisition de backlinks de qualité, suivi des stratégies de netlinking. 🔹 Suivi & Analyse des KPI SEO : Suivi du trafic, positions Google, performances des backlinks. 🔹 Création de sites web : Développement de sites vitrines & e-commerce (WordPress, WooCommerce, CMS divers). 🔹 Testing & Optimisation de sites web : Tests de performance, UX/UI, compatibilité mobile et sécurité. 📊 Outils maîtrisés : 🔸 Seanking, Ahrefs, Mongools, Dokey.io, Google Search Console, GTmetrix, Monitorank, Semjuice, Yoast SEO, Screaming Frog, WordPress, WooCommerce. ✅ Objectif : Améliorer la visibilité des sites (coachs, e-commerce, génération de leads, blogs), optimiser leur référencement et garantir une expérience utilisateur optimale. 📩 Contactez-moi pour optimiser ou créer votre site web et améliorer votre classement sur Google !🚀\nCompétences : Spring Boot · node js · Développement Android · SEO off-page · Java · flutter · ASP.NET · WordPress · Angular\nSpring Boot · node js · Développement Android · SEO off-page · Java · flutter · ASP.NET · WordPress · Angular"
            },
            {
                "title": "Développeur web and Mobile",
                "company": "VNB-IT · Temps plein",
                "from": "oct. 2024",
                "to": "déc. 2024",
                "description": "Participation active à la maintenance et à l’évolution d’applications mobiles de location immobilière (React Native).\nCollaboration avec plusieurs équipes projet sur le développement de nouvelles fonctionnalités (authentification, paiements, cartographie).\nIntégration de services tiers : Google Maps, Stripe (paiement), authentification via JWT.\nContribution à la synchronisation en temps réel et à la gestion des notifications via Firebase.\nApprofondissement de mes compétences en architecture mobile MVC, UI/UX et bonnes pratiques de développement.\nParticipation active à la maintenance et à l’évolution d’applications mobiles de location immobilière (React Native). Collaboration avec plusieurs équipes projet sur le développement de nouvelles fonctionnalités (authentification, paiements, cartographie). Intégration de services tiers : Google Maps, Stripe (paiement), authentification via JWT. Contribution à la synchronisation en temps réel et à la gestion des notifications via Firebase. Approfondissement de mes compétences en architecture mobile MVC, UI/UX et bonnes pratiques de développement."
            },
            {
                "title": "Ingénieur en développement full-stack mobile et web",
                "company": "Xceed · Stage",
                "from": "févr. 2024",
                "to": "sept. 2024",
                "description": "Développement complet d'une application mobile de restauration depuis zéro avec Flutter (frontend), Node.js et MongoDB (backend), et API RESTful sécurisée.\n\nAnalyse fonctionnelle : gestion des utilisateurs, restaurants, foods, categories, carts, orders, ratings, addresses, et tunnel de commande optimisé.\n\nConception de l’architecture logicielle et modélisation avec diagrammes UML (cas d’utilisation, classes, séquences).\n\nIntégration de Stripe (paiements en ligne), Google Maps API (géolocalisation) et Firebase Cloud Messaging (notifications push en temps réel).\n\nRéalisation d’une UI/UX mobile-first, fluide et responsive, pour Android & iOS.\n\nMise en œuvre de tests unitaires, tests d’intégration et validation utilisateur.\n\nRédaction de la documentation technique (API, schémas, guide de déploiement) pour assurer la maintenabilité du projet.\nDéveloppement complet d'une application mobile de restauration depuis zéro avec Flutter (frontend), Node.js et MongoDB (backend), et API RESTful sécurisée. Analyse fonctionnelle : gestion des utilisateurs, restaurants, foods, categories, carts, orders, ratings, addresses, et tunnel de commande optimisé. Conception de l’architecture logicielle et modélisation avec diagrammes UML (cas d’utilisation, classes, séquences). Intégration de Stripe (paiements en ligne), Google Maps API (géolocalisation) et Firebase Cloud Messaging (notifications push en temps réel). Réalisation d’une UI/UX mobile-first, fluide et responsive, pour Android & iOS. Mise en œuvre de tests unitaires, tests d’intégration et validation utilisateur. Rédaction de la documentation technique (API, schémas, guide de déploiement) pour assurer la maintenabilité du projet.\nCompétences : MySQL · Agile Development · stripe · React.js · Logiciel Stripe · Hooks React · mongo db · HTML5 · studio 3t · node js · MongoDB · JSON Web Token (JWT) · back end · Développement Android · Applications mobiles · Java · Flutter · Firebase · Applications web · Langage de modélisation unifié (UML) · Node.js\nMySQL · Agile Development · stripe · React.js · Logiciel Stripe · Hooks React · mongo db · HTML5 · studio 3t · node js · MongoDB · JSON Web Token (JWT) · back end · Développement Android · Applications mobiles · Java · Flutter · Firebase · Applications web · Langage de modélisation unifié (UML) · Node.js"
            },
            {
                "title": "Développeur Java",
                "company": "Training edge consulting · Stage",
                "from": "juin 2023",
                "to": "sept. 2023",
                "description": "Developed a car rental web application using Python and Django (MVT architecture) with a\n clean and responsive UI.\n Implemented user authentication, car listing with filtering, and a complete reservation system\n including availability check and total price calculation.\n Built admin dashboard for car management (CRUD), booking tracking, and data export.\n Integrated email notifications and used SQLite (or PostgreSQL) for data storage.\nDeveloped a car rental web application using Python and Django (MVT architecture) with a clean and responsive UI. Implemented user authentication, car listing with filtering, and a complete reservation system including availability check and total price calculation. Built admin dashboard for car management (CRUD), booking tracking, and data export. Integrated email notifications and used SQLite (or PostgreSQL) for data storage.\nCompétences : MySQL · SQL · Agile Development · React.js · Logiciel Stripe · CSS · Hooks React · HTML5 · studio 3t · JSON Web Token (JWT) · back end · Java · Flutter · AngularJS · Travail d’équipe · Firebase · Spring Data · Conception visuelle · Langage de modélisation unifié (UML) · Node.js\nMySQL · SQL · Agile Development · React.js · Logiciel Stripe · CSS · Hooks React · HTML5 · studio 3t · JSON Web Token (JWT) · back end · Java · Flutter · AngularJS · Travail d’équipe · Firebase · Spring Data · Conception visuelle · Langage de modélisation unifié (UML) · Node.js"
            },
            {
                "title": "Développeur Full-Stack",
                "company": "MANDITECH SARL · Stage",
                "from": "juin 2022",
                "to": "sept. 2022",
                "description": "Conception et développement : Création d'une plateforme en ligne de réservation de voitures utilisant Java Spring Boot pour le back-end et Vue.js/Angular pour le front-end, offrant une interface fluide et intuitive.\n\nGestion des disponibilités des véhicules : Développement d'un système de gestion des véhicules, permettant aux utilisateurs de consulter en temps réel les véhicules disponibles pour la location selon les dates et lieux choisis.\n\nNotifications automatiques : Implémentation d'un système de notifications automatiques pour informer les utilisateurs des confirmations, modifications ou annulations de réservation.\n\nAuthentification des utilisateurs et contrôle d'accès : Mise en place d'un système sécurisé d'authentification, avec gestion des rôles (administrateur, utilisateur), pour un accès contrôlé aux différentes fonctionnalités de la plateforme.\n\nSuivi et gestion des réservations : Intégration d'un tableau de bord pour les administrateurs, permettant de suivre l’historique des réservations et de générer des rapports statistiques.\n\nTechnologies utilisées : Java, Spring Boot, MySQL, Vue.js/Angular\nConception et développement : Création d'une plateforme en ligne de réservation de voitures utilisant Java Spring Boot pour le back-end et Vue.js/Angular pour le front-end, offrant une interface fluide et intuitive. Gestion des disponibilités des véhicules : Développement d'un système de gestion des véhicules, permettant aux utilisateurs de consulter en temps réel les véhicules disponibles pour la location selon les dates et lieux choisis. Notifications automatiques : Implémentation d'un système de notifications automatiques pour informer les utilisateurs des confirmations, modifications ou annulations de réservation. Authentification des utilisateurs et contrôle d'accès : Mise en place d'un système sécurisé d'authentification, avec gestion des rôles (administrateur, utilisateur), pour un accès contrôlé aux différentes fonctionnalités de la plateforme. Suivi et gestion des réservations : Intégration d'un tableau de bord pour les administrateurs, permettant de suivre l’historique des réservations et de générer des rapports statistiques. Technologies utilisées : Java, Spring Boot, MySQL, Vue.js/Angular\nCompétences : PHP · Agile Development · Logiciel Stripe · .NET framework · CSS · HTML5 · back end · Java · AngularJS · Shopify · Firebase · Langage de modélisation unifié (UML)\nPHP · Agile Development · Logiciel Stripe · .NET framework · CSS · HTML5 · back end · Java · AngularJS · Shopify · Firebase · Langage de modélisation unifié (UML)"
            }
        ],
        "educations": [
            {
                "institution": "Ecole Marocaine des Sciences de l'ingénieur",
                "degree": "Ingénierie Informatique et Réseaux MIAGE",
                "from": "2019",
                "to": "2024",
                "description": "Compétences : Rust · Langage de modélisation unifié (UML) · Node.js · Ensemble de compétences techniques · MySQL · PHP · Esprit · .NET framework · Leadership technique · CSS · Tests d’acceptation · C++ · Next.js · Conception web · Débogage · Kotlin · Agile Development · Odoo · Firebase · Compatibilité multinavigateur · Applications web · ai · Pandas (logiciel) · Machine Learning Operations (MLOps) · AngularJS · MongoDB · OpenID · Développement Android · SOAP · back end · Analyse client · Lingo · ASP.NET · JSON Web Token (JWT) · Ingénierie · Spring Data · Côté serveur · Science informatique · Java · Terraform · Design pour Android · Flutter · Hooks React · Bus de service Azure · Développement front-end · HTML5\nRust · Langage de modélisation unifié (UML) · Node.js · Ensemble de compétences techniques · MySQL · PHP · Esprit · .NET framework · Leadership technique · CSS · Tests d’acceptation · C++ · Next.js · Conception web · Débogage · Kotlin · Agile Development · Odoo · Firebase · Compatibilité multinavigateur · Applications web · ai · Pandas (logiciel) · Machine Learning Operations (MLOps) · AngularJS · MongoDB · OpenID · Développement Android · SOAP · back end · Analyse client · Lingo · ASP.NET · JSON Web Token (JWT) · Ingénierie · Spring Data · Côté serveur · Science informatique · Java · Terraform · Design pour Android · Flutter · Hooks React · Bus de service Azure · Développement front-end · HTML5"
            }
        ],
        "interests": [],
        "accomplishments": [],
        "contacts": []
    },
    {
        "url": "https://www.linkedin.com/in/ahmedbentabet",
        "profile": {
            "name": "Ahmed BENTABET",
            "location": "Maroc",
            "about": "I specialize in building high-performance, secure backend systems with a focus on optimization and efficiency. With hands-on experience in Python, C, SQL, and low-level programming, I tackle complex technical challenges head-on to deliver robust solutions.\n\nAt ALX Africa, I worked on real-world projects that sharpened my skills in performance tuning, security, and system architecture. These experiences have given me a deep understanding of backend development, from optimizing code to securing large-scale applications.\n\nI approach every project with a focus on solving problems through clean, efficient code. My goal is to collaborate on projects where I can apply my expertise in backend systems and continue to grow as a developer.\n\nIf you have an interesting project in mind, feel free to contact me at contact.bentabet@gmail.com or on Telegram: @ahmedbentabet.\n…voir plus",
            "open_to_work": "N/A"
        },
        "experiences": [
            {
                "title": "N/A",
                "company": "alx_africa ",
                "from": "Contrat en",
                "to": "N/A",
                "description": "Specialization : Back-end Development\nSpecialization : Back-end Development\naoût 2024 - févr. 2025 · 7 mois\nDu août 2024 au févr. 2025 · 7 mois\nIn the Back-end Development specialization, I gained in-depth knowledge of:\n\n- Advanced JavaScript (ES6, TypeScript) and backend frameworks (Node.js, Flask).\n- Database management with SQL (MySQL, PostgreSQL) and NoSQL (MongoDB, Redis).\n- Authentication & Security, including encryption, token-based authentication, and data protection.\n- Scalability techniques such as caching, pagination, and background job processing (queues).\n- RESTful API development, third-party service integration, and best practices for API security and performance.\n- Performance optimization, load balancing, and system reliability strategies.\n\nPortfolio Project – Foodify\n\n- Developed Foodify, a full-stack application showcasing database design, API development, and system architecture.\n- Implemented user authentication, data caching, and asynchronous task processing for a seamless experience.\n- Designed an optimized, scalable backend with SQLAlchemy, Flask, and RESTful APIs.\n- Integrated third-party services to enhance functionality and user experience.\nIn the Back-end Development specialization, I gained in-depth knowledge of: - Advanced JavaScript (ES6, TypeScript) and backend frameworks (Node.js, Flask). - Database management with SQL (MySQL, PostgreSQL) and NoSQL (MongoDB, Redis). - Authentication & Security, including encryption, token-based authentication, and data protection. - Scalability techniques such as caching, pagination, and background job processing (queues). - RESTful API development, third-party service integration, and best practices for API security and performance. - Performance optimization, load balancing, and system reliability strategies. Portfolio Project – Foodify - Developed Foodify, a full-stack application showcasing database design, API development, and system architecture. - Implemented user authentication, data caching, and asynchronous task processing for a seamless experience. - Designed an optimized, scalable backend with SQLAlchemy, Flask, and RESTful APIs. - Integrated third-party services to enhance functionality and user experience.\nSoftware Engineering Foundations\nSoftware Engineering Foundations\nfévr. 2023 - juil. 2024 · 1 an 6 mois\nDu févr. 2023 au juil. 2024 · 1 an 6 mois\nALX Software Engineering Program is an intensive, project-based curriculum designed to cultivate problem-solving skills and real-world technical expertise. The program emphasizes hands-on learning, collaboration, and industry best practices in system programming, full-stack development, and DevOps, preparing engineers to tackle complex challenges at scale.\n\n - Proficient in C programming, with expertise in memory management, data structures, algorithms, and shell scripting.\n - Strong Linux and Git foundation, including file systems, permissions, networking, and automation.\n - Hands-on experience in Python, SQL, APIs, DevOps, and system architecture, applying best practices for scalable and maintainable software.\n - Built and contributed to large-scale projects, including Simple Shell, printf implementation, and an Airbnb Clone, demonstrating problem-solving, low-level programming, and software design skills.\nALX Software Engineering Program is an intensive, project-based curriculum designed to cultivate problem-solving skills and real-world technical expertise. The program emphasizes hands-on learning, collaboration, and industry best practices in system programming, full-stack development, and DevOps, preparing engineers to tackle complex challenges at scale. - Proficient in C programming, with expertise in memory management, data structures, algorithms, and shell scripting. - Strong Linux and Git foundation, including file systems, permissions, networking, and automation. - Hands-on experience in Python, SQL, APIs, DevOps, and system architecture, applying best practices for scalable and maintainable software. - Built and contributed to large-scale projects, including Simple Shell, printf implementation, and an Airbnb Clone, demonstrating problem-solving, low-level programming, and software design skills.\nCompétences : Linux · C · Python · MySQL · JavaScript · Data Structures · Algorithms · DevOps\nLinux · C · Python · MySQL · JavaScript · Data Structures · Algorithms · DevOps"
            }
        ],
        "educations": [
            {
                "institution": "CPGE - Classes préparatoires aux grandes écoles",
                "degree": "MP/MPSI, Mathematics, Physics, and Engineering Sciences",
                "from": "2014",
                "to": "2022",
                "description": "Completed an intensive undergraduate program in Mathematics, Physics, and Engineering Sciences, a highly demanding curriculum designed to prepare students for France’s top engineering schools. This experience strengthened my problem-solving, logical reasoning, and analytical skills—essential for tackling complex challenges in engineering and technology.\n\nBeyond three years of formal education, I spent five additional years rigorously self-studying the CPGE curriculum, striving for admission to the most elite institutions. While I ultimately did not meet their exceptionally high standards, this journey reinforced my ability to learn independently, persevere through challenges, and manage time effectively—skills that now drive my success in software engineering and beyond.\nCompleted an intensive undergraduate program in Mathematics, Physics, and Engineering Sciences, a highly demanding curriculum designed to prepare students for France’s top engineering schools. This experience strengthened my problem-solving, logical reasoning, and analytical skills—essential for tackling complex challenges in engineering and technology. Beyond three years of formal education, I spent five additional years rigorously self-studying the CPGE curriculum, striving for admission to the most elite institutions. While I ultimately did not meet their exceptionally high standards, this journey reinforced my ability to learn independently, persevere through challenges, and manage time effectively—skills that now drive my success in software engineering and beyond.\nCompétences : Time Management · Problem Solving · Self Learning\nTime Management · Problem Solving · Self Learning"
            }
        ],
        "interests": [],
        "accomplishments": [],
        "contacts": []
    }
]